app/controllers/friends_controller.rb

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email_address", "phone_number", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "email_address" = ?, "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["email_address", "caninetable@fake.com"], ["twitter", "@caninetable"], ["updated_at", "2023-06-02 18:59:57.858674"], ["id", 5]]